<template>
  <div>
    <Header_dow />
    <div class="contorl">
      <div class="TextContent">
        <h1>用户协议</h1>
        <p>创建日期：2023年5月11日</p>
        <p>最近更新：2023年5月22日</p>
        <h2>服务条款</h2>
        <p>
          这些服务条款适用于您对 时间印迹、我们位于https://lovetime.life
          的网站以及提供的任何相关服务的使用。 当您使用 时间印迹
          时，您同意遵守这些服务条款并遵守所有适用的法律和法规。如果您不同意这些服务条款，您将被禁止进一步使用该应用程序、访问我们的网站或使用
          时间印迹 提供的任何其他服务。 如果您从 Apple App Store 访问或下载
          时间印迹，您同意 App Store 服务条款中规定的任何使用规则。
          我们保留自行决定审查和修改任何这些服务条款的权利。对这些服务条款的任何更改将从发布之日起立即生效。
        </p>
        <h2>使用限制</h2>
        <p>
          通过使用 时间印迹
          和我们的网站，您代表您自己、您所代表的任何已签署这些服务条款的实体以及您的用户保证您不会：
        </p>
        <p>
          1. 修改、复制、准备 时间印迹 或 时间印迹
          或我们网站上包含的任何材料和软件的衍生作品、反编译或反向工程；
        </p>
        <p>
          2.
          从时间印迹或我们网站上包含的任何材料和软件中删除任何版权或其他专有符号；
        </p>
        <p>
          3. 将 时间印迹
          或其任何相关材料转移给另一个人或将材料“镜像”到任何其他服务器上；
        </p>
        <p>
          4. 以滥用或破坏我们的网络或任何其他服务的方式故意或无意地使用 时间印迹
          或其任何相关服务；
        </p>
        <p>
          5. 使用 时间印迹
          或其相关服务传输或发布任何骚扰、不雅、淫秽、欺诈或非法材料；
        </p>
        <p>6. 违反任何适用法律或法规使用 时间印迹 或其相关服务；</p>
        <p>7. 使用 时间印迹 发送未经授权的广告或垃圾邮件；</p>
        <p>8. 未经用户同意收集、收集或收集用户数据；</p>
        <p>
          9.
          以可能侵犯第三方隐私权、知识产权或其他权利的方式使用时间印迹或其相关服务。
        </p>
        <h2>知识产权</h2>
        <p>
          我们网站上的材料的知识产权归 时间印迹及其创始团队所有。您可以下载
          时间印迹，在您的移动设备上查看、使用和显示该应用程序，仅供您个人使用。
          这构成许可的授予，而不是所有权的转让。如果您违反任何这些限制或这些服务条款，该许可将自动终止，并且
          时间印迹 可以随时终止。
        </p>
        <!-- 换行 -->
        <br />
        <h2>自动更新</h2>
        <p>
          您允许我们根据您的隐私偏好在您的设备上下载和安装 时间印迹
          的更新。通过从您的设备中删除 时间印迹，可以随时撤销此权限。
        </p>
        <br />
        <h2>责任</h2>
        <p>
          时间印迹
          以及我们网站上的材料均按“原样”提供。在法律允许的范围内，不作任何明示或暗示的保证，并特此否认并否定所有其他保证，包括但不限于适销性、特定用途适用性或不侵犯知识产权的暗示保证或条件，或其他侵犯权利的行为。
          在任何情况下，对于您或任何第三方因素使用或无法使用
          时间印迹、我们的网站或提供的任何其他服务或 时间印迹
          中的材料而遭受或招致的任何间接损失，时间印迹团队或其供应商概不负责，即使如果时间印迹团队或授权代表已被口头或书面通知此类损坏的可能性。
          在本协议的上下文中，“间接损失”包括任何间接损失、实际或预期的利润损失、利益损失、收入损失、业务损失、商誉损失、机会损失、储蓄损失、名誉损失、使用损失和/或数据丢失或损坏，无论是根据法规、合同、衡平法、侵权（包括疏忽）、赔偿或其他规定。
          由于某些司法管辖区不允许限制默示保证，或限制间接或附带损害的责任，因此这些限制可能对您不适用。
        </p>
        <br />
        <h2>Pro订阅协议</h2>
        <p>
          1. 经付费开启 Pro 订阅服务后，你可以在相应服务期限内持续访问 时间印迹
          内 Pro
          包含的全部功能。（包括：1、可添加更多的习惯和分类。2、展示更多的更全面的数据。3、自动备份。4、更多日记。5、更多桌面小组件。6、暗黑模式及未来更新。
        </p>
        <p>
          2.连续包月和连续包年服务是在你已开启 Pro
          订阅服务的前提下，向你提供的自动续费服务。如你开通连续包月或连续包年服务，则视为你授权「时间印迹」在你已开通的
          Pro
          订阅服务即将到期时，从你的自有充值账户、与「时间印迹」绑定的第三方支付账户、银行卡、通讯账号、iTunes账户（简称“账户”）等代扣下一个计费周期的服务费用。扣费时间为计费周期到期前24小时内。
          你需要将 「时间印迹」
          与前述账户进行绑定，且保证有足够余额支持代扣。因上述账户余额不足导致续费失败的，你将自行承担相应结果。
        </p>
        <p>
          3. 支付后Pro未到账的解决办法 如果您在订阅并支付后，Pro
          服务未及时生效，请尝试更新至最新版App，然后在Pro个人中心页点击“恢复购买”即可恢复Pro特权，如尝试后仍未解决，请联系我们（邮箱：solovetime@163.com）
        </p>
        <p>
          注：订阅与Apple ID有强相关，使用app期间如果切换apple ID
          可能导致数据错误，需自行负责。
        </p>
        <h2>关于苹果的通知</h2>
        <p>
          就您在 iOS
          设备上使用或访问时间印迹而言，您承认并同意本条款的条款。您承认这些服务条款仅在您和时间印迹之间，而不是在
          Apple Inc. (Apple) 之间，Apple
          不对时间印迹和时间印迹中可用的任何材料负责。 Apple
          没有义务向您提供与时间印迹有关的任何维护和支持服务。 如果 时间印迹
          不符合任何适用的保证，您可以通知 Apple，Apple
          将向您退还移动应用程序的购买价款。在适用法律允许的最大范围内，Apple 对
          时间印迹
          不承担任何其他保修义务，并且因未遵守任何保修而导致的任何其他索赔、损失、责任、损害、成本或费用将由我们负责。
          Apple 不负责处理您或任何第三方提出的与 时间印迹 或您使用 时间印迹
          相关的任何索赔，包括但不限于 (1) 产品责任索赔；(2)
          任何声称我们的移动应用程序不符合任何适用的法律或监管要求；(3)
          根据消费者保护或类似立法产生的索赔。 Apple
          不负责调查、辩护、解决和解除任何第三方声称我们的移动应用程序侵犯第三方知识产权的索赔。
          您同意在使用 时间印迹 时遵守任何适用的第三方条款，包括 Apple App Store
          服务协议中规定的任何使用规则。 Apple 和 Apple
          的子公司是本服务条款的第三方受益人，在您接受本服务条款后，Apple
          将有权（并将被视为已接受该权利）对您执行本服务条款，因为这些服务条款的第三方受益人。
        </p>
        <h2>法律及协议更新</h2>
        <p>
          根据国家法律法规变化及网站运营需要，我们有权对本协议条款不时地进行修改，并根据国家法律法规的要求进行公示，修改后的协议在公示后生效并代替原来的协议。你应不时关注并阅读最新版的协议及网站公告。如你不同意更新后的新协议，你有权立即停止使用我们的产品和/或服务。如你继续使用我们的产品和/或服务，即视为完全同意更新后的协议。如果本协议中任何一条被司法或行政机关判定废止、无效或因任何理由不可执行，该条应视为可分的且并不影响任何其余条款的有效性和可执行性。
          上述条款将受中华人民共和国法律的约束并依据其解释。如出现纠纷，用户和时间印迹团队一致同意将纠纷交由当地人民法院管辖。如用户对本服务条款内容有任何疑问，可发邮件至(solovetime@163.com)获取相关信息。
        </p>
      </div>
      <div class="Bottombar">
        <img src="../img/logo@2x.png" alt="" />
        <p>记录专注，预见未来</p>
      </div>
    </div>
  </div>
</template>
<script>
import Header_dow from "../components/Header_dow.vue";
export default {
  name: "thanks",
  components: {
    Header_dow,
  },
};
</script>
<style scoped>
.contorl {
  width: 100%;
  height: 100%;
  background-image: url("../img/background.png");
  background-size: 493px;
  background-repeat: no-repeat;
  background-position-y: 390px;
  background-position-y: 100px;
  background-attachment: fixed;
  font-size: 16px;
  font-size: 16px;
}

.TextContent {
  margin: 0 auto;
  width: 50%;
  padding-top: 100px;
}

h1 {
  color: #2c2e32;
  margin-bottom: 30px;
}

h2 {
  color: #2c2e32;
  margin-bottom: 10px;
  margin-top: 10px;
}
p {
  margin-top: 10px;
}

h3 {
  color: #2c2e32;
  margin-bottom: 10px;
  margin-top: 10px;
}

.TextContent p {
  color: #2c2e32;
  line-height: 30px;
}

.Bottombar {
  margin-top: 234px;
  text-align: center;
  padding-bottom: 70px;
}

.Bottombar img {
  width: 100px;
  height: 100px;
}

.Bottombar p {
  color: #2c2e32;
  font-size: 14px;
  margin-top: 10px;
  font-weight: 600;
  color: #72767d;
}

/* 中等屏幕（桌面显示器，大于等于 992px） */
@media (max-width: 1199px) and (min-width: 768px) {
  .TextContent {
    margin: 0 auto;
    width: 70%;
    padding-top: 100px;
  }
}

/* 超小屏幕（手机，小于 768px） */
@media (max-width: 768px) {
  .TextContent {
    margin: 0 auto;
    width: 90%;
    padding-top: 100px;
  }
  .contorl {
      width: 100%;
      height: 100%;
      background-image: url("../img/background.png");
      background-size: 300px !important;
      background-repeat: no-repeat;
      background-position-y: 390px;
      background-position-y: 100px;
      background-attachment: fixed;
      font-size: 16px;
      font-size: 16px;
    }
}
</style>
